# NavisworksExporterService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..NavisworksExporterService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which supports export of the model to Navisworks.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId NavisworksExporterService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NavisworksExporterService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ NavisworksExporterService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace